src/test/resource/Request_XML/1814.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://schema.walgreens.com/icp/pharm/pharmsigservices/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:PharmSIGServiceWrapperRequest>
         <OriginalParsedSIGToken>
            <MiscNotes>937ea49031ff416bb7725070aaf343d7</MiscNotes>
         </OriginalParsedSIGToken>
         <TransmittedSIG>1 tab(s) once a week</TransmittedSIG>
         <DrugType>
            <DosageFormCd>59749.0</DosageFormCd>
            <DosageFormType>60029.0</DosageFormType>
            <DrugDefaultSig>5.9749001254E10</DrugDefaultSig>
	            <DrugStrength>654472.0</DrugStrength>
            <DrugStrengthUOM>RX</DrugStrengthUOM>
            <GPI>0.0</GPI>
            <NDC>N</NDC>
            <RouteOfAdminCodedVal>5.9377000794E10</RouteOfAdminCodedVal>
            <SingleActiveIngredientInd>59749.0</SingleActiveIngredientInd>
            <DrugClassType>crocin9</DrugClassType>
         </DrugType>
         <PatientType>
            <Age>68</Age>
            <FirstName>PATIENT</FirstName>
         </PatientType>
      </v1:PharmSIGServiceWrapperRequest>
   </soapenv:Body>
</soapenv:Envelope>
